src/cfe/МенеджерСинхронизаций/InformationRegisters/МС_ЖурналОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МС_ЖурналОбмена</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_УровниЖурналаОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МС_ЗапросыКВнешнимИсточникам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НастройкаСинхронизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МС_НастройкиСинхронизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗапуска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/CommonModules/МС_ЖурналОбменаСервер/Ext/Module.bsl
// Универсальный журнал обмена МенеджерСинхронизаций: регистр сведений МС_ЖурналОбмена.
// Сделан по образцу журналов обмена расширения Битрикс (БУС_Логирование, БУС_ЖурналОшибок) и регистра са_Аудит.
//
// Запись журнала: Период, НастройкаСинхронизации (ведущее измерение), ИдентификаторЗапуска (общий для всех
// записей одного запуска обмена), НомерЗаписи (порядок внутри запуска), Уровень (информация, предупреждение,
// ошибка), Запрос, Операция, Сообщение, ДанныеСообщения (текст сообщения, тело ответа).
//
// Контекст журнала (настройка синхронизации, идентификатор запуска, счетчик записей) хранится
// в СтруктураПараметров.КонтекстЖурналаОбмена. Конвейер создает его один раз на запуск обмена,
// чтобы записи всех запросов запуска имели общий идентификатор и сквозную нумерацию.
//
// Запись выполняется в привилегированном режиме: пользователю, который запускает обмен,
// права на регистр не нужны.

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает контекст журнала для одного запуска обмена.
//
// Параметры:
//   НастройкаСинхронизации - СправочникСсылка.МС_НастройкиСинхронизации, Неопределено - настройка обмена.
//
// Возвращаемое значение:
//   Структура:
//     * НастройкаСинхронизации - СправочникСсылка.МС_НастройкиСинхронизации - ведущее измерение записей.
//     * ИдентификаторЗапуска - Число - общий идентификатор записей запуска.
//     * НомерЗаписи - Число - номер последней записи запуска.
//
Функция НовыйКонтекстЖурнала(НастройкаСинхронизации = Неопределено) Экспорт

	Контекст = Новый Структура;
	Контекст.Вставить("НастройкаСинхронизации", ?(ЗначениеЗаполнено(НастройкаСинхронизации),
		НастройкаСинхронизации, Справочники.МС_НастройкиСинхронизации.ПустаяСсылка()));
	Контекст.Вставить("ИдентификаторЗапуска", ТекущаяУниверсальнаяДатаВМиллисекундах());
	Контекст.Вставить("НомерЗаписи", 0);
	Возврат Контекст;

КонецФункции

// Добавляет запись в журнал обмена.
//
// Параметры:
//   СтруктураПараметров - Структура - параметры обмена МС. Используются поля:
//     * КонтекстЖурналаОбмена - см. НовыйКонтекстЖурнала. Если поля нет (вызов вне конвейера),
//                               контекст создается по полю НастройкаСинхронизации и сохраняется в структуре.
//     * НастройкаЗагрузки - СправочникСсылка.МС_ЗапросыКВнешнимИсточникам - запрос, в рамках которого запись.
//   Уровень - ПеречислениеСсылка.МС_УровниЖурналаОбмена - уровень записи.
//   Сообщение - Строка - описание события.
//   Операция - Строка - вид операции, например "RabbitMQ.Получение".
//   ДанныеСообщения - Строка - данные: текст сообщения, тело запроса или ответа. Записываются как есть.
//
Процедура ДобавитьЗапись(СтруктураПараметров, Уровень, Сообщение, Операция = "", ДанныеСообщения = "") Экспорт

	Контекст = Неопределено;
	Если Не СтруктураПараметров.Свойство("КонтекстЖурналаОбмена", Контекст) Тогда
		НастройкаСинхронизации = Неопределено;
		СтруктураПараметров.Свойство("НастройкаСинхронизации", НастройкаСинхронизации);
		Контекст = НовыйКонтекстЖурнала(НастройкаСинхронизации);
		СтруктураПараметров.Вставить("КонтекстЖурналаОбмена", Контекст);
	КонецЕсли;
	Контекст.НомерЗаписи = Контекст.НомерЗаписи + 1;

	Запрос = Неопределено;
	СтруктураПараметров.Свойство("НастройкаЗагрузки", Запрос);

	УстановитьПривилегированныйРежим(Истина);

	Запись = РегистрыСведений.МС_ЖурналОбмена.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДатаСеанса();
	Запись.НастройкаСинхронизации = Контекст.НастройкаСинхронизации;
	Запись.ИдентификаторЗапуска = Контекст.ИдентификаторЗапуска;
	Запись.НомерЗаписи = Контекст.НомерЗаписи;
	Запись.Уровень = Уровень;
	Если ТипЗнч(Запрос) = Тип("СправочникСсылка.МС_ЗапросыКВнешнимИсточникам") Тогда
		Запись.Запрос = Запрос;
	КонецЕсли;
	Запись.Операция = Операция;
	Запись.Сообщение = Сообщение;
	Запись.ДанныеСообщения = Строка(ДанныеСообщения);
	Запись.Записать();

КонецПроцедуры

// Удаляет записи журнала старше указанной даты.
//
// Параметры:
//   ДатаОбрезки - Дата - записи с периодом раньше этой даты удаляются.
//
// Возвращаемое значение:
//   Число - количество удаленных записей.
//
Функция ОчиститьЖурнал(ДатаОбрезки) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Удалено = 0;
	Выборка = РегистрыСведений.МС_ЖурналОбмена.Выбрать(, ДатаОбрезки - 1);
	Пока Выборка.Следующий() Цикл
		Выборка.ПолучитьМенеджерЗаписи().Удалить();
		Удалено = Удалено + 1;
	КонецЦикла;

	Возврат Удалено;

КонецФункции

#КонецОбласти

#КонецЕсли
